{
    "bienvenida": ["Hola. Soy tu Asistente Virtual. Fui creada para instruirte todo respecto a la Ejecucion de instrucciones. Antes de empezar ¿Podrias decirme tu nombre?"],
    
    "aprendizaje": ["Los computadores son sistemas sincronizados que operan con una instruccion de reloj. Las operaciones basicas, que son transferencias de datos dentro de la CPU, tienen una duracion minima determinada por el tiempo entre dos flancos consecutivos de la instruccion de reloj. Cuando un computador ejecuta una instruccion, sigue un orden especifico de operaciones basicas. En un mismo periodo de la instruccion de reloj, se pueden realizar varias operaciones basicas en paralelo, siempre y cuando no interfieran al compartir recursos como buses o elementos internos del procesador."],
    
    "fases":["Como se puede apreciar en la imagen, Las instrucciones tipicas que ejecuta un computador suelen dividirse en cuatro fases. Cada fase tiene una duracion mayor que un ciclo de la senal de reloj y contiene una serie de operaciones basicas que pueden ejecutarse en paralelo o en serie. Las fases que componen una instruccion son: Lectura. Decodificacion. Ejecucion. Almacenamiento."],
    
    "lectura":["La fase de lectura de instruccion es la primera fase del ciclo de instruccion de un procesador. En esta fase, el procesador busca la instruccion en la memoria. El primer paso es cargar el registro MAR con el contenido del registro PC. Luego, el procesador activa las senales de lectura de la memoria y guarda el dato en el registro MDR. Finalmente, el procesador transfiere el dato al registro IR. Este proceso se realiza dos veces en el ejemplo del computador porque las instrucciones son de 16 bits, mientras que los buses externos de datos y la memoria se consideran con una longitud de palabra de 8 bits."],
    
    "decodificacion":["En esta fase, la CPU interpreta la instruccion almacenada en el registro IR. La decodificacion implica entender que operacion se debe realizar y que datos se necesitan. Ademas, en esta etapa, se determinan las ubicaciones de memoria o registros donde se encuentran los operandos. La CPU puede cargar los operandos en registros internos para su posterior procesamiento."],
    
    "ejecucion":["Una vez que la CPU ha decodificado la instruccion y ha adquirido los operandos, se procede a realizar la operacion indicada por la instruccion. Esto puede implicar operaciones aritmeticas, logicas o de transferencia de datos. En esta fase, los datos se procesan y se generan los resultados de acuerdo con la operacion especificada."],
    
    "almacenamiento":["Finalmente, en esta fase, los resultados de la operacion se almacenan en la ubicacion adecuada, que puede ser en la memoria, en registros internos o en otro lugar. Ademas, si es necesario actualizar el estado de los registros, se realiza en esta etapa. Esto asegura que los resultados esten disponibles para instrucciones posteriores o para la transferencia a dispositivos de salida, si es necesario."],

    "PE PREGUNTA 01": ["PRIMERA PREGUNTA: ¿Cual es el objetivo principal del pensamiento computacional?",
                        "a) Resolver problemas utilizando algoritmos y abstraccion. b) Programar robots y sistemas autonomos. c) Diseñar hardware de computadoras."],
    "PE PREGUNTA 02": ["SEGUNDA PREGUNTA: 2. El primer paso del pensamiento computacional es: identificar el problema.",
                        "¿VERDADERO? o ¿FALSO?"],
    "PE PREGUNTA 03": ["TERCERA PREGUNTA: ¿Qué es un algoritmo en terminos de pensamiento computacional?",
                        "1) Un patron de diseño visual 2) Un lenguaje de programacion 3) Una secuencia de pasos para resolver un problema 4) Una representacion grafica de datos"]
    
}




